#include <iostream>
#include <cmath>
#define pi 3.1415926535
using namespace std;
int main()
{
	int k = 10, n=40;
	double a = 0.1, b = 0.8, e = 0.0001, s = (b - a) / k;

	for (double x = a; x <= b+0.0001; x += s) /*перебираем х(как в условии) от 0.1 до 0.8, но к 0.8 добавляем 000.1, потому что при каждом шаге х += s погрешность
		накапливается и крайний результат будет 0.79999999... , тем самым не достигнув 0.8*/
	{
		//чтобы вычислить функцию, используем сумму ряда для заданного n
		double s_n = 0.0;// изначально сумма 0
		for (int i = 1;i <= n;++i)//перебираем i, начиная с 1, и до n, увеличивая i на 1
		{
			s_n += pow(x, i) * sin(i * pi / 4.0);//к сумме прибавляем значение каждого нового слагаемого, который вычисляется по формуле
		}
		//используем сумму ряда для заднной точности е
		double s_e = 0.0;//сумма=0
		double t = x * sin(pi / 4);// считаем первое слагаемое
		for (int i = 1;fabs(t) >= e; ++i)//перебираем i, начиная с 1, и до тех пор пока модуль текущего слагаемого больше или равно заданной точности
		{
			s_e += t;//к сумме прибаляем значение текущего слагаемого
			t = pow(x, i + 1) * sin((i + 1) * pi / 4);/*считаем следующее t.так как первое слагаемое t мы уже посчитали, то нужно увеличть i на 1 в формуле, чтобы
			не добавить два раза первое слагаемое в сумму*/
		}

		double y = (x * sin(pi / 4)) / (1 - 2 * x * cos(pi / 4) + pow(x, 2));/*вычисляем точное зачение функции алгебраически, через готовую математическую формулу,
		чтобы сравнить с суммами*/

		cout << "x= " << x << ' ' << "s_n= " << s_n << ' ' << "s_e= " << s_e << ' ' << "y= " << y <<endl;//выводим и сравниваем полученные значения функции
	}
	return 0;
}